#include<stdio.h>
int main()
{
    int x=5;
    int *ptr;
    ptr=&x;

    printf("value of x = %d\n",x);
    printf("address of x = %u\n",&x); 
    printf("address of pointer = %d\n",ptr);
    printf("value of pointer = %d\n",*ptr);
    printf("pointer variable address = %d\n",&ptr);

    return 0;
}

    /*এম্বারস্যান্ড (&) অপারেটর: এটি রেফারেন্সিং (Referencing) অপারেটর নামে পরিচিত। 
    এটি কোনো ভেরিয়েবলের মেমরি অ্যাড্রেস বের করতে ব্যবহৃত হয়।*/

    /*অ্যাস্টেরিস্ক (*) অপারেটর: এটি ডিরেফারেন্সিং (Dereferencing) অপারেটর। 
    পয়েন্টারের ভেতর থাকা মেমরি অ্যাড্রেসে যে মান বা ভ্যালু রাখা আছে, তা পেতে এটি ব্যবহার করা হয়।*/
    

/*
C-তে, পয়েন্টার হলো এমন একটি ভেরিয়েবল যা কোনো ভেরিয়েবলের ঠিকানা সংরক্ষণ করতে ব্যবহৃত হয়।
ভেরিয়েবলটি int, char, array ইত্যাদির মতো যেকোনো ধরনের হতে পারে। 
পয়েন্টারের আকার কম্পিউটার আর্কিটেকচারের উপর নির্ভর করে, 
তবে একটি ৩২-বিট সিস্টেমের জন্য ব্যবহৃত পয়েন্টারটি ২ বাইটের হয়।


পয়েন্টারের সুবিধা
১.এটি মেমরি অ্যাড্রেস সরাসরি অ্যাক্সেস করতে দেয়。
২.ফাংশন থেকে একাধিক মান ফেরত (Return) পেতে সাহায্য করে।
৩.ডায়নামিক মেমরি অ্যালোকেশন (যেমন: malloc, calloc) করতে পয়েন্টার অপরিহার্য।


অন্যান্যঃ

C-তে, পয়েন্টার হলো এমন একটি ভেরিয়েবল যা কোনো ভেরিয়েবলের ঠিকানা সংরক্ষণ করতে ব্যবহৃত হয়। 
ভেরিয়েবলটি int, char, array ইত্যাদির মতো যেকোনো ধরনের হতে পারে। পয়েন্টারের আকার 
কম্পিউটার আর্কিটেকচারের উপর নির্ভর করে, তবে একটি ৩২-বিট সিস্টেমের জন্য ব্যবহৃত 
পয়েন্টারটি ২ বাইটের হয়।

সি-তে পয়েন্টারের ব্যবহার নিচে দেওয়া হলো:

রেফারেন্স ব্যবহার করে আর্গুমেন্ট পাস করার জন্য।
অ্যারের উপাদানগুলো অ্যাক্সেস করার জন্য।
malloc() এবং calloc() ফাংশন ব্যবহার করে ডাইনামিক মেমরি অ্যালোকেশন করা যায় ।
কোডের পারফরম্যান্স উন্নত করার জন্য অ্যারে ও ফাংশনে ব্যবহৃত হয়।
একাধিক মান ফেরত দেওয়ার জন্য।
একটি ডেটা স্ট্রাকচার বাস্তবায়ন করা।
সিস্টেম-লেভেল প্রোগ্রামিং করার জন্য।
C-তে পয়েন্টারের বৈশিষ্ট্যগুলো কী কী?
সি-তে পয়েন্টার ব্যবহারের বৈশিষ্ট্যগুলো নিচে দেওয়া হলো:

এটি মেমরির জায়গা বাঁচায়।
পয়েন্টার ব্যবহার করলে কোডের এক্সিকিউশন টাইম দ্রুততর হয়, কারণ এক্ষেত্রে অ্যাড্রেসের মাধ্যমে 
ডেটা ম্যানিপুলেট করা হয়, যা মেমরি লোকেশনে সরাসরি অ্যাক্সেসের জন্যও ব্যবহৃত হয়।
পয়েন্টার ব্যবহার করে দক্ষতার সাথে মেমরি অ্যাক্সেস করা যায়, কারণ পয়েন্টার মেমরি বরাদ্দ 
এবং মুক্ত করার জন্য ব্যবহৃত হয়। সুতরাং এই সিদ্ধান্তে আসা যায় যে, পয়েন্টারের মেমরি 
ডায়নামিকভাবে অবস্থিত।
এটি দ্বিমাত্রিক বা বহুমাত্রিক অ্যারে উপস্থাপনের জন্য একটি ডেটা স্ট্রাকচারের সাথে ব্যবহার 
করা যেতে পারে।
পয়েন্টার ব্যবহার করে যেকোনো ধরনের অ্যারে অ্যাক্সেস করা যায়।
এতে ফাইল পরিচালনার একটি বৈশিষ্ট্য রয়েছে।
গতিশীলভাবে মেমরি বরাদ্দ করতে পারে।
বেস ক্লাসে কোনো পয়েন্টার ঘোষণা করা হলে, সেটি ডিরাইভড ক্লাসের অবজেক্ট অ্যাক্সেস 
করতে পারে, কিন্তু এর বিপরীতটি সম্ভব নয়।




*/

