#include<stdio.h>
main()
{
    auto int x=1;
    {
        auto int x=2;
        {
            auto int x=3;
            printf("%d\n",x);
        }
        printf("%d\n",x);
    }
    printf("%d\n",x);

    getch();
}


/* 
সি প্রোগ্রামিং-এ, স্টোরেজ ক্লাসগুলো নির্ধারণ করে যে ভেরিয়েবলগুলো মেমরিতে কীভাবে সংরক্ষিত,
অ্যাক্সেস এবং রক্ষণাবেক্ষণ করা হবে। চারটি প্রধান স্টোরেজ ক্লাস হলো অটোম্যাটিক, রেজিস্টার, 
স্ট্যাটিক এবং এক্সটার্ন , যার প্রত্যেকটি ভেরিয়েবলের আচরণ ব্যবস্থাপনার ক্ষেত্রে একটি স্বতন্ত্র উদ্দেশ্য পূরণ করে।

সি-স্টোরেজ ক্লাসেস (C-Storage Classes):
একটা ভেরিয়েবল অথবা একটা ফাংশন কোন সীমার মাঝে ব্যবহার করা যাবে এবং কতক্ষণ সেই 
ভেরিয়েবল/ফাংশনটা কার্যকর থাকবে সেটা স্টোরেজ ক্লাস (Storage Class) দ্বারা নির্ধারিত হয়। 
সি প্রোগ্রামিং এ আমরা সাধারণত চার ধরনের স্টোরেজ (Storage Class) দেখতে পাই -

৪। এক্সটার্ন (extern)

অটোমেটিক স্টোরেজ (automatic storage):
যেসকল ভেরিয়েবল একটা ব্লকের মধ্যে নির্ধারণ করা হয়, তাদেরকে অটোমেটিক ভেরিয়েবল বলে।
সি-প্রোগ্রামিং এর নিয়ম অনুযায়ী সমস্ত লোকাল ভেরিয়েবল নিজে থেকেই আটোমেটিক হয়ে থাকে। 
আর অটোমেটিক স্টোরেজ ক্লাস হচ্ছে সব লোকাল ভেরিয়েবলের জন্য ডিফল্ট (default) স্টোরেজ ক্লাস। 
ভেরিয়েবল নির্ধারণ করার সময় auto কী-ওয়ার্ড লিখলেও চলে, না লিখলেও চলে -

রেজিস্টার স্টোরেজ (register storage):
যেসকল ভেরিয়েবল একটা ব্লকের মধ্যে নির্ধারণ করা হয়, তাদেরকে লোকাল ভেরিয়েবল বলে।
সি-প্রোগ্রামিং এর নিয়ম অনুযায়ী সমস্ত লোকাল ভেরিয়েবল নিজে থেকেই আটোমেটিক হয়ে থাকে। 
আর অটোমেটিক স্টোরেজ ক্লাস হচ্ছে সব লোকাল ভেরিয়েবলের জন্য ডিফল্ট (default) স্টোরেজ ক্লাস। 
অনেক সময় দ্রুত হিসাব-নিকাশ সম্পন্ন করার জন্য আমরা যদি লোকাল ভেরিয়েবল্গুলো কম্পিউটারের 
র‌্যাম (RAM) এর পরিবর্তে রেজিস্টারে নির্ধারণ করে দিতে চাই তাহলে সেই কাজটি করে দেয় রেজিস্টার 
স্টোরেজ ক্লাস -

স্ট্যাটিক স্টোরেজ (static storage):
যে ভেরিয়েবল স্ট্যাটিক কী-ওয়ার্ড (keyword) দিয়ে নির্ধারণ করা হয়, তাকে স্ট্যাটিক ভেরিয়েবল বলে।
আর স্ট্যাটিক স্টোরেজ ক্লাস হচ্ছে সব স্ট্যাটিক ভেরিয়েবলের জন্য ডিফল্ট (default) স্টোরেজ ক্লাস।
উপরের সোর্স কোডটি বিশ্লেষণ করলে দেখা যাবে যে, প্রথমবার increment() ফাংশনকে কল করার 
সময় int num = 1 দ্বারা পূর্ণসংখ্যা টাইপের একটি ভেরিয়েবল নির্ধারণ করা হয় যার মান হল ১,num 
ভেরিয়েবল যেহেতু স্ট্যাটিক হিসেবে বলে দেওয়া হয়েছে, সেহেতু প্রতিবার increment() ফাংশন কল 
করার সময় আর নতুন করে num ভেরিয়েবলের মান ১ নির্ধারিত হবে না। বরং, গত ফাংশন কলের 
পরে num ভেরিয়েবলের পরিবর্তিত মান-টিই থেকে যাবে। তাই প্রথমবার increment() ফাংশন কলের 
পরে num ভেরিয়েবলের মান হয়েছে ২,এরপর আবার কল করার পরে এটি হয়েছে ৩,num ভেরিয়েবল
স্ট্যাটিক হিসেবে বলে দেওয়া না হলে কিন্তু এমনটা হতো না।

এক্সটার্নাল স্টোরেজ (external storage):
একটা সফটওয়্যারের প্রোগ্রামগুলো সাধারণত অনেকগুলো সোর্স ফাইলে লেখা হয়। ধরাযাক, 
একটা সোর্স ফাইলের প্রোগ্রামে নির্ধারিত কোন ভেরিয়েবল অন্য একটা সোর্স ফাইলের প্রোগ্রামে 
ব্যবহার করার প্রয়োজন পড়ল। তখন প্রথম সোর্স ফাইলে ভেরিয়েবলটি নির্ধারণ করার সময় আমরা 
extern কী-ওয়ার্ড ব্যবহার করবো যাতে করে সেই ভেরিয়েবলটা পরে অন্য কোন ফাইলে ব্যবহার করা যায়।

আর এক্সটার্নাল স্টোরেজ ক্লাস হচ্ছে সব এক্সটার্নাল ভেরিয়েবলের জন্য ডিফল্ট (default) স্টোরেজ ক্লাস।


*/
